console.log(`1. Часы и календарь 15/15 \n
2. Приветствие 10/10 \n
3. Смена фонового изображения 20/20 \n
4. Виджет погоды 15/15 \n
5. Виджет цитата дня 10/10 \n
6. Аудиоплеер 15/15 \n
7. Продвинутый аудиоплеер (реализуется без использования библиотек) 20/20 \n
8. Перевод приложения на два языка (en/ru) 15/15 \n
9. Получение фонового изображения от API 10/10 \n
10. Настройки приложения 20/20 \n
11. Дополнительный функционал на выбор 0/10 \n
Не хватило времени на todo, проверять нечего :( \n
ИТОГО 150
`)